ilia-moroz-ees/PDM-testing/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_S" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@10.02.00"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-S)" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@10.02.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const ioexp           = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1          = ioexp.addInstance();
const adc             = scripting.addModule("/drivers/adc/adc", {}, false);
const adc1            = adc.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const gpio3           = gpio.addInstance();
const gpio4           = gpio.addInstance();
const gpio5           = gpio.addInstance();
const gpio6           = gpio.addInstance();
const gpio7           = gpio.addInstance();
const gpio8           = gpio.addInstance();
const gpio9           = gpio.addInstance();
const gpio10          = gpio.addInstance();
const gpio11          = gpio.addInstance();
const gpio12          = gpio.addInstance();
const gpio13          = gpio.addInstance();
const gpio14          = gpio.addInstance();
const gpio15          = gpio.addInstance();
const gpio16          = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const i2c2            = i2c.addInstance();
const i2c3            = i2c.addInstance();
const mcspi           = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1          = mcspi.addInstance();
const mcspi2          = mcspi.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const gpio_int_xbar   = scripting.addModule("/xbar/gpio_int_xbar/gpio_int_xbar", {}, false);
const gpio_int_xbar1  = gpio_int_xbar.addInstance();
const gpio_int_xbar2  = gpio_int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ioexp1.$name                                    = "CONFIG_IOEXP0";
ioexp1.TCA6424ARGJR_port1_pinSPI1_MUX_SEL_mode  = 0;
ioexp1.TCA6424ARGJR_port1_pinSPI1_MUX_SEL_state = 1;
ioexp1.TCA6424ARGJR_port1_pinI2C0_MUX_SEL_mode  = 0;
ioexp1.TCA6424ARGJR_port1_pinI2C0_MUX_SEL_state = 1;

adc1.$name               = "ADC1";
adc1.adcClockPrescaler   = "ADC_CLK_DIV_4_0";
adc1.enableConverter     = true;
adc1.enableInterrupt1    = true;
adc1.soc2Channel         = "ADC_CH_ADCIN2";
adc1.soc3Channel         = "ADC_CH_ADCIN3";
adc1.soc4Channel         = "ADC_CH_ADCIN4";
adc1.soc5Channel         = "ADC_CH_ADCIN5";
adc1.interrupt1SOCSource = "ADC_SOC_NUMBER2";
adc1.interrupt3SOCSource = "ADC_SOC_NUMBER4";
adc1.interrupt4SOCSource = "ADC_SOC_NUMBER5";
adc1.soc1Channel         = "ADC_CH_ADCIN1";
adc1.ADC.$assign         = "ADC1";
adc1.ADC.AIN0.pu_pd      = "pd";
adc1.ADC.AIN1.pu_pd      = "pd";
adc1.ADC.AIN2.pu_pd      = "pd";
adc1.ADC.AIN3.pu_pd      = "pd";
adc1.ADC.AIN4.pu_pd      = "pd";
adc1.ADC.AIN5.pu_pd      = "pd";

gpio1.trigType       = "FALL_EDGE";
gpio1.enableIntr     = true;
gpio1.$name          = "GPIO48";
gpio1.GPIO_n.$assign = "EPWM2_B";

gpio2.$name          = "GPIO44";
gpio2.defaultValue   = "1";
gpio2.trigType       = "FALL_EDGE";
gpio2.enableIntr     = true;
gpio2.GPIO_n.$assign = "EPWM0_B";

gpio3.$name          = "GPIO45";
gpio3.trigType       = "FALL_EDGE";
gpio3.enableIntr     = true;
gpio3.GPIO_n.$assign = "EPWM1_A";

gpio4.$name          = "GPIO46";
gpio4.trigType       = "FALL_EDGE";
gpio4.enableIntr     = true;
gpio4.GPIO_n.$assign = "EPWM1_B";

gpio5.$name          = "GPIO51";
gpio5.enableIntr     = true;
gpio5.trigType       = "FALL_EDGE";
gpio5.GPIO_n.$assign = "EPWM4_A";

gpio6.$name          = "GPIO52";
gpio6.enableIntr     = true;
gpio6.trigType       = "FALL_EDGE";
gpio6.GPIO_n.$assign = "EPWM4_B";

gpio7.$name          = "GPIO53";
gpio7.pinDir         = "OUTPUT";
gpio7.GPIO_n.$assign = "EPWM5_A";

gpio8.$name          = "GPIO54";
gpio8.pinDir         = "OUTPUT";
gpio8.GPIO_n.$assign = "EPWM5_B";

gpio9.$name          = "GPIO123";
gpio9.pinDir         = "OUTPUT";
gpio9.GPIO_n.$assign = "SDFM0_D0";

gpio10.pinDir         = "OUTPUT";
gpio10.$name          = "GPIO136";
gpio10.GPIO_n.$assign = "MCAN2_TX";

